tap "felixkratz/formulae"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Arbitrary precision numeric processing language
brew "bc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Open-source GitLab command-line tool
brew "glab"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Command-line tool to customize Spotify client
brew "spicetify-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Incremental parsing library
brew "tree-sitter"
# Parser generator tool
brew "tree-sitter-cli"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Desktop password and login vault
cask "bitwarden"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-noto-sans-symbols-2"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Sheet music editor software for guitar, bass, keyboards, drums and more
cask "guitar-pro"
# Software for iLok devices
cask "ilok-license-manager"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Professional audio software for audio recording, mixing, broadcast and others
cask "izotope-product-portal"
# Keyboard customiser
cask "karabiner-elements"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Web browser
cask "librewolf"
# TeX distribution
cask "miktex-console"
# Administration tool for Native Instruments products
cask "native-access"
# Digital audio production application
cask "reaper"
# Installer for installation and license activation of Softube products
cask "softube-central"
# Music streaming service
cask "spotify"
# Tool to download files for Steinberg products
cask "steinberg-download-assistant"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Gecko based web browser
cask "zen"
vscode "aaron-bond.better-comments"
vscode "adalinesimonian.reabank-syntax-highlighting"
vscode "antoinebalaine.reascript-docs"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "burkeholland.simple-react-snippets"
vscode "code-nature.nilesoft-shell-file-formatter"
vscode "dcasella.monokai-plusplus"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-monokai-night"
vscode "formulahendry.auto-rename-tag"
vscode "gavinray.reascript"
vscode "github.github-vscode-theme"
vscode "gruntfuggly.todo-tree"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "navelpluisje.reaper"
vscode "rastikerdar.vscode-seedling-icon-theme"
vscode "ritwickdey.liveserver"
vscode "stuartwang.luapanda"
vscode "sumneko.lua"
vscode "twxs.cmake"
vscode "vscodevim.vim"
